      *********************** Example File ***********************

000001 01 MY-GRP.
000002 05   ACCT-TYPE PIC X.
000003 05   ACCT-TYPE-NAMED.
000004 10     FIRST-NAME PIC X(10).
000005 10     LAST-NAME PIC X(5).
000005 10     LAST-NAME-E PIC 99999.
000006 10     OPEN-YEAR PIC 9999 COMP-3.
000007 05   ACCT-TYPE-TRUST REDEFINES ACCT-TYPE-NAMED.
000008 10     TRUST-NAME PIC X(15).
000009 10     OPEN-YEAR PIC 9999 COMP-3.
000010 10     FILLER PIC X(5).
000011 05   ACCT-NUMBER PIC 9(5) COMP-3.
000012 05   ACCT-VALUE PIC S9(7)V99 COMP-3.
