000000    01 FILLER-TEST-GRP.
000000    05   SOMETHING PIC X(3).
000001    05   MY-GROUP-1.
000002    10     FILLER PIC X(5).
000003    10     SOME-DATA PIC X(10).
000004    10     FILLER PIC X(5).
000005    05   FILLER REDEFINES MY-GROUP-1.
000006    10     FILLER PIC X(20).
000007    05   FILLER REDEFINES MY-GROUP-1.
000008    10     FILLER PIC X(10).
000009    10     FILLER PIC X(10).

000010    05   MY-GROUP-2 REDEFINES MY-GROUP-1.
000011    10     FILLER OCCURS 4 TIMES.
000012    15       FILLER PIC X(5).

000013    05   MY-GROUP-3 REDEFINES MY-GROUP-1.
000014    10     FILLER OCCURS 4 TIMES.
000015    15       SOME-FIELD PIC X(1).
000016    15       FILLER OCCURS 2 TIMES.
000017    20         FILLER PIC X(2).
000200    02 SECOND-LEVEL-0.
000200    05   SOME-OTHER-FIELD PIC X(200).
000200    05   ANOTHER-OTHER-FIELD PIC X(10).    
